docs/site/20220321161835-performing_electroacoustic_music.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-10 Mon 22:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Performing Electroacoustic Music</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Performing Electroacoustic Music</h1>
<p>
Performers need lots of time with the electronics. <a href="20220321161233-masone16_performance_practice.html#ID-3e38b5ac-eef2-4ac0-9af5-c9c096f30795">masone16-performance-practice</a>
</p>

<p>
Issues of performace practice need to be expanded to include electronics. <a href="20220321161233-masone16_performance_practice.html#ID-3e38b5ac-eef2-4ac0-9af5-c9c096f30795">masone16-performance-practice</a> <a href="20220414105913-yoder10_performancepractice.html#ID-3b281ea4-740d-481f-860c-8609298ce5fb">yoder10-performancepractice</a>
</p>

<p>
The ambiguity of notation means that performers have to make interpretive decisions. <a href="20220331154848-kilroy19_notation.html#ID-316a357c-59ed-4558-b6f5-2668bd2414bf">kilroy19-notation</a> Many like having a study score and a performance score <a href="20220414111357-yoder10_notation.html#ID-3a0b6e58-8726-49f7-ad28-a25da4926b6a">yoder10-notation</a>
</p>

<p>
The posthuman perspective could inform perfomance practice for electronics. However a single practice is unlikely due to the variety and ever changing technology. <a href="20220331153537-kilroy19_posthuman.html#ID-a3ae4ab1-3ffd-4f29-8fe2-3a4fc80ff337">kilroy19-posthuman</a>
</p>

<p>
The loudspeaker can become an instrument to play itself. <a href="20220228113243-emmerson16_performance.html#ID-23094d6b-2a56-42f7-9829-f34adab4f00f">emmerson16-performance</a>
</p>

<p>
Enns has developed a self-sufficient approach to reduce the dependence on sound designers and composers in performing live electroacoustic music. <a href="20220411151323-enns17_self_sufficient.html#ID-84a53d2f-f002-45e5-9565-751ce7fb5946">enns17-self-sufficient</a>
</p>

<p>
Interactive music requires more roles and different skills than other types of music <a href="20220414105913-yoder10_performancepractice.html#ID-3b281ea4-740d-481f-860c-8609298ce5fb">yoder10-performancepractice</a>
</p>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
